In [19]:
import os
import pandas as pd
import numpy as np

dir_data = 'C:\\Users\\0920b\\Documents\\GitHub\\'

f_app = os.path.join(dir_data, 'application_test.csv')
print('Path of read in data: %s' % (f_app))
app_test = pd.read_csv(f_app)
app_test.head()

#資料的 row 數以及 column 數
app_test.shape

#資料的資訊
app_test.info()

#列出所有欄位
app_test.columns
#app_test.tail(2)

Path of read in data: C:\Users\0920b\Documents\GitHub\application_test.csv
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48744 entries, 0 to 48743
Columns: 121 entries, SK_ID_CURR to AMT_REQ_CREDIT_BUREAU_YEAR
dtypes: float64(65), int64(40), object(16)
memory usage: 45.0+ MB

Index(['SK_ID_CURR', 'NAME_CONTRACT_TYPE', 'CODE_GENDER', 'FLAG_OWN_CAR',
       'FLAG_OWN_REALTY', 'CNT_CHILDREN', 'AMT_INCOME_TOTAL', 'AMT_CREDIT',
       'AMT_ANNUITY', 'AMT_GOODS_PRICE',
       ...
       'FLAG_DOCUMENT_18', 'FLAG_DOCUMENT_19', 'FLAG_DOCUMENT_20',
       'FLAG_DOCUMENT_21', 'AMT_REQ_CREDIT_BUREAU_HOUR',
       'AMT_REQ_CREDIT_BUREAU_DAY', 'AMT_REQ_CREDIT_BUREAU_WEEK',
       'AMT_REQ_CREDIT_BUREAU_MON', 'AMT_REQ_CREDIT_BUREAU_QRT',
       'AMT_REQ_CREDIT_BUREAU_YEAR'],
      dtype='object', length=121)

In [21]:
#資料的 row 數以及 column 數
app_test.shape

(48744, 121)

In [22]:
#資料的資訊
app_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48744 entries, 0 to 48743
Columns: 121 entries, SK_ID_CURR to AMT_REQ_CREDIT_BUREAU_YEAR
dtypes: float64(65), int64(40), object(16)
memory usage: 45.0+ MB

In [17]:
#截取部分資料
app_test[["SK_ID_CURR","CODE_GENDER","AMT_ANNUITY"]].head(10)

   SK_ID_CURR CODE_GENDER  AMT_ANNUITY
0      100001           F      20560.5
1      100005           M      17370.0
2      100013           M      69777.0
3      100028           F      49018.5
4      100038           M      32067.0
5      100042           F      34600.5
6      100057           M      22117.5
7      100065           M      14220.0
8      100066           F      28957.5
9      100067           F       5337.0

In [18]:
app_test.loc[5:10,["SK_ID_CURR","CODE_GENDER","AMT_ANNUITY"]]

    SK_ID_CURR CODE_GENDER  AMT_ANNUITY
5       100042           F      34600.5
6       100057           M      22117.5
7       100065           M      14220.0
8       100066           F      28957.5
9       100067           F       5337.0
10      100074           F      25447.5